[
    {
        "id": "town_EN1",
        "name": "Epicrotea",
        "owner_id": "clan_empire_north_2",
        "owner_name": "Argoros",
        "culture": "empire",
        "x_position": "407.645",
        "y_position": "474.297",
        "prosperity": "5100",
        "wall_level": "3",
        "desc_text": "Epicrotea, the 'All-Conquering' was named after the eccentric long-haired military genius Sarapios, who crushed a Battanian host and secured the lands west of Lake Laconis for the Empire. Its towers, overlooking the Miron river, have frequently been a northerner's first glimpse of the awesome and terrible force to their south.",
        "bound_villages": [
            "village_EN1_1",
            "village_EN1_2",
            "village_EN1_3"
        ]
    },
    {
        "id": "town_EN2",
        "name": "Diathma",
        "owner_id": "clan_empire_north_1",
        "owner_name": "Osticos",
        "culture": "empire",
        "x_position": "465.971",
        "y_position": "475.17",
        "prosperity": "4700",
        "wall_level": "1",
        "desc_text": "Diathma, the city of the Divine Decree, was erected by an imperial general on the ruins of a Dryatic shrine overlooking Lake Laconis. It was the last stand of the Dryatics, the northernmost of the Palaic peoples, who rebelled against the Empire and were overcome. According to legend they were pushed back into the shallows of the lake and fought until they were exhausted and the bloody waters engulfed them.",
        "bound_villages": [
            "village_EN2_1",
            "village_EN2_2"
        ]
    },
    {
        "id": "town_EN3",
        "name": "Saneopa",
        "owner_id": "clan_empire_north_3",
        "owner_name": "Neretzes",
        "culture": "empire",
        "x_position": "513.339",
        "y_position": "419.099",
        "prosperity": "4600",
        "wall_level": "3",
        "desc_text": "Saneopa sits on a low pass leading from the Nevys valley to the north to the pool of the Ophthys. The ancient Palaic peoples of this region, like the Battanians, treated lakes as sacred sites, and the Ophthys in particular was said to be a gateway to another world. The hustle and bustle of Saneopa, one of the main trading centers of inland Calradia, stands in sharp contrast to the dark and silent waters below.",
        "bound_villages": [
            "village_EN3_1",
            "village_EN3_3"
        ]
    },
    {
        "id": "town_EN4",
        "name": "Argoron",
        "owner_id": "clan_empire_north_1",
        "owner_name": "Osticos",
        "culture": "empire",
        "x_position": "534.622",
        "y_position": "495.804",
        "prosperity": "2800",
        "wall_level": "2",
        "desc_text": "The city of Argoron sits where the cold, slow moving Nevys River meets Lake Laconis. This was once the land of the Laconians, who saw the Empire as a protector against the more warlike Palaic peoples. They welcomed and intermarried with imperial settlers and their chiefs joined the Senate, and their old language and customs faded away.",
        "bound_villages": [
            "village_EN4_2",
            "village_EN4_4"
        ]
    },
    {
        "id": "town_EN5",
        "name": "Myzea",
        "owner_id": "clan_empire_north_5",
        "owner_name": "Dolentos",
        "culture": "empire",
        "x_position": "604.173",
        "y_position": "426.101",
        "prosperity": "3900",
        "wall_level": "2",
        "desc_text": "Myzea gives its name to the Myzeiad, the rich hill country of the east-central empire. This region is the old stomping grounds of the senator Litos, who brought the Palaic tribes here into the empire relatively peacefully by offering them protection against raiders from the steppes. When he fell afoul of his rivals in the Senate, however, he tried to organize them into a rival 'barbarian' republic modelled on the ancient Calradian version. The empire snuffed it out, but the people here, now thoroughly Calradicized, still harbor an attachment to the old republican system and its partisans.",
        "bound_villages": [
            "village_EN5_1",
            "village_EN5_2",
            "village_EN5_4"
        ]
    },
    {
        "id": "town_EN6",
        "name": "Amprela",
        "owner_id": "clan_empire_north_4",
        "owner_name": "Impestores",
        "culture": "empire",
        "x_position": "620.342",
        "y_position": "483.919",
        "prosperity": "2300",
        "wall_level": "3",
        "desc_text": "Amprela is the foremost town of the far northeast of the Empire. Watchmen stand atop its towers, looking out for beacons from the frontier fortresses to the north, east and west that might signal the approach of raiders. Horse archers recruited from the rough Eleftheroi freemen drink in the barracks, waiting for the order to ride out against horsemen from the steppe. Cataphracts sally through its gates to vie with the princes of Sturgia for control of the trade crossing the nearby network of lakes known as the Iltan portages.",
        "bound_villages": [
            "village_EN6_1",
            "village_EN6_2"
        ]
    },
    {
        "id": "town_EW1",
        "name": "Lageta",
        "owner_id": "clan_empire_west_3",
        "owner_name": "Dionicos",
        "culture": "empire",
        "x_position": "315.287",
        "y_position": "397.114",
        "prosperity": "5200",
        "wall_level": "3",
        "desc_text": "Lageta was infamously acquired by the Empire by an act of treachery. A rogue imperial mercenary murdered the Palaic chieftain who employed him, took the citadel, invited in imperial colonists, then bequeathed the town to the Empire. The Senate disavowed his action but accepted the bequest. The district is now thoroughly Calradicized, but the Battanians to the north remember, and whenever an imperial envoy speaks of the sanctity of treaties and pacts, they just nod to each other and say, 'Lageta.'",
        "bound_villages": [
            "village_EW1_1",
            "village_EW1_2"
        ]
    },
    {
        "id": "town_EW2",
        "name": "Zeonica",
        "owner_id": "clan_empire_west_1",
        "owner_name": "Comnos",
        "culture": "empire",
        "x_position": "412.41",
        "y_position": "287.631",
        "prosperity": "4500",
        "wall_level": "3",
        "desc_text": "Zeonica sits by the seaside at the base of the Iltaric hills, a land of wine, grain and horses. It was named for the Lady Zeona, one of the few women to rule the Empire - admittedly as regent for her son rather than Empress Regnant. It is known for the Zeonic Wind, a gale that blows northward across the Perassic Sea every summer carrying the burning heat of the Nahasa desert to the imperial south. In other seasons the weather here is mild, a weather pattern that has provided many a poet with a metaphor for the transience of passion.",
        "bound_villages": [
            "village_EW2_2",
            "village_EW2_3",
            "village_EW2_4"
        ]
    },
    {
        "id": "town_EW3",
        "name": "Jalmarys",
        "owner_id": "clan_empire_west_1",
        "owner_name": "Comnos",
        "culture": "empire",
        "x_position": "376.986",
        "y_position": "341.692",
        "prosperity": "2700",
        "wall_level": "1",
        "desc_text": "Every realm has a city whose inhabitants are mocked for their provincial unsophistication, and for the Empire that city was Jalmarys. One of the first imperial colonies established inland of the Perassic Sea, it served the Empire as a base to subdue the western Palaic tribes. Paravenos was happy to accept the plunder and slaves sent to them from its garrison, but snickered at them behind their backs. That changed when the Jalmaryan general Carsos staged a military coup. When a senator, stymied by his thick accent, nervously asked him to repeat a decree, he unsheathed his sword and said, 'Do you understand this?'",
        "bound_villages": [
            "village_EW3_2",
            "village_EW3_3"
        ]
    },
    {
        "id": "town_EW4",
        "name": "Ortysia",
        "owner_id": "clan_empire_west_2",
        "owner_name": "Varros",
        "culture": "empire",
        "x_position": "303.859",
        "y_position": "331.889",
        "prosperity": "5600",
        "wall_level": "2",
        "desc_text": "Ortysia, named for the quails who inhabit the nearby coastal marshes, was the first Calradian colony on the shores of the Perassic Sea. In its early centuries, it fell under the authority of the Kannic city-state of Quyaz, but the empire's expansion soon united the colony with its mother republic. For centuries, sailors coming from the pirate-infested islands of the Bay of Charas gave thanks when they saw its towers looming through the haze of the western Perassic, signalling a return to safe imperial-patrolled waters.",
        "bound_villages": [
            "village_EW4_1",
            "village_EW4_3",
            "village_EW4_4"
        ]
    },
    {
        "id": "town_EW5",
        "name": "Amitatys",
        "owner_id": "clan_empire_west_4",
        "owner_name": "Elaches",
        "culture": "empire",
        "x_position": "441.84",
        "y_position": "352.923",
        "prosperity": "4400",
        "wall_level": "3",
        "desc_text": "The Palaic chieftain of Amitatys had a particularly grim reputation, a tyrant who slaughtered innocents to appease the gods of the underworld in the hope they would grant him immortality. Inevitably, he fell into conflict with the Empire, and during the siege an earthquake crumbled his walls and allowed imperial troops into the city. More died in the ensuing sack than the tyrant had ever killed, but it was war, and the outcome - attributed to the wrath of Heaven - was a staple of imperial propaganda as they expanded their foothold in the region.",
        "bound_villages": [
            "village_EW5_1",
            "village_EW5_2"
        ]
    },
    {
        "id": "town_EW6",
        "name": "Rhotae",
        "owner_id": "clan_empire_west_5",
        "owner_name": "Lonalion",
        "culture": "empire",
        "x_position": "390.118",
        "y_position": "393.159",
        "prosperity": "4900",
        "wall_level": "2",
        "desc_text": "Rhotae is a former Palaic hill-fort in the shadow of the basalt slab of Mount Erithrys, once known as Rotash. It fell to the Empire shortly afer Lageta. The Palaic chief here, when he heard of what happened to his neighbor, slaughtered a dozen imperial citizens under his protection. The eccentric long-haired general Sarapios led the punitive column that took Rotash and burned it to the ground. 'Lageta we took treacherously but with little bloodshed. Rotash we took honorably, with great bloodshed,' he supposedly said afterwards. 'Both will be remembered as a stain on our name. The victor always takes the blame, but keeps the gold.'",
        "bound_villages": [
            "village_EW6_1",
            "village_EW6_3",
            "village_EW6_4"
        ]
    },
    {
        "id": "town_ES1",
        "name": "Danustica",
        "owner_id": "clan_empire_south_3",
        "owner_name": "Mestricaros",
        "culture": "empire",
        "x_position": "661.191",
        "y_position": "276.466",
        "prosperity": "4900",
        "wall_level": "3",
        "desc_text": "The frontier city of Danustica dominates the network of lakes and lagoons known as the Calsea. It has long held the line against incursions by the Aserai and various Darshi shahs and padishahs further to the east. Many an imperial legionary stationed here has scribbled graffiti on its walls cursing the city's sweltering summers, brackish water and the mosquitos that rise from the Calsea, but the inhabitants are proud of their role as border defenders and mock the soldiers wilting in the heat around them.",
        "bound_villages": [
            "village_ES1_2",
            "village_ES1_3",
            "village_ES1_4"
        ]
    },
    {
        "id": "town_ES2",
        "name": "Vostrum",
        "owner_id": "clan_empire_south_4",
        "owner_name": "Hongeros",
        "culture": "empire",
        "x_position": "568.779",
        "y_position": "239.989",
        "prosperity": "5100",
        "wall_level": "1",
        "desc_text": "Vostrum was founded by the Calradian mercenary Archacos, one of a number of rogue commanders who broke away from the empire during its expansion. Unlike some, who tried to reproduce the empire's republican heritage, he chose to rule as a god-king. His dynasty lasted for generations, until imperial troops overran it and smashed every haloed statue of Archacos and his successors into rubble. Even today, western and northern imperial senators accuse families from this region of being closet monarchists.",
        "bound_villages": [
            "village_ES2_2",
            "village_ES2_3",
            "village_ES2_4"
        ]
    },
    {
        "id": "town_ES3",
        "name": "Poros",
        "owner_id": "clan_empire_south_2",
        "owner_name": "Leonipardes",
        "culture": "empire",
        "x_position": "471.018",
        "y_position": "269.821",
        "prosperity": "4500",
        "wall_level": "3",
        "desc_text": "The town of Poros sits near the northern shores of the Perassic Sea. The warm rolling hills of these parts are well suited to the raising of sheep and horses. The herdsmen have a reputation for being proud and violent, but the nobles of the Leonipardes clan who rule this land are careful to respect their autonomy. Livestock rustling and blood feuds are common here, and it is said that the Leonipardes will never interfere unless invited by both parties, but when they do, their judgments will be obeyed by all.",
        "bound_villages": [
            "village_ES3_1",
            "village_ES3_2",
            "village_ES3_3"
        ]
    },
    {
        "id": "town_ES4",
        "name": "Lycaron",
        "owner_id": "clan_empire_south_1",
        "owner_name": "Pethros",
        "culture": "empire",
        "x_position": "515.33",
        "y_position": "333.562",
        "prosperity": "3800",
        "wall_level": "3",
        "desc_text": "The natural fortress of Lycaron sits on a spur jutting out of the great Ornian rock. In the final years of the imperial conquest, the Palaic tribe here negotiated a peaceful federation with the empire, only to see their home seized by the rebel leader Gethuz. The ensuing siege was only the first of many that Lycaron would undergo in the ensuing centuries, as its nearby silver mines made it a prize for every imperial pretender who ever tried to seize power in a civil war. It is said that the colony of vultures who inhabit the upper reaches of the Rock have dined on the flesh of every people of Calradia.",
        "bound_villages": [
            "village_ES4_1",
            "village_ES4_3"
        ]
    },
    {
        "id": "town_ES5",
        "name": "Onira",
        "owner_id": "clan_empire_south_1",
        "owner_name": "Pethros",
        "culture": "empire",
        "x_position": "645.315",
        "y_position": "325.385",
        "prosperity": "3400",
        "wall_level": "1",
        "desc_text": "The tale of Sarpea of Onira is one of the epic poems of the eastern frontier. Like many, it seems written to justify the Empire's conquest. Sarpea, a senator's daughter, was seized by a Palaic chieftain and carried to his citadel here. When the imperial armies appeared before its walls years later to rescue her, she begged them to retreat for the sake of her infant son, whom her fearsome husband had threatened to hurl from the walls instead of allowing him to be captured and raised by his mother's people. The legions withdrew, so the story says, but the boy grew into a warrior who joined the Empire and slew his father. It is now the center of a horse-breeding industry on the eastern plains.",
        "bound_villages": [
            "village_ES5_1",
            "village_ES5_2",
            "village_ES5_3"
        ]
    },
    {
        "id": "town_ES6",
        "name": "Phycaon",
        "owner_id": "clan_empire_south_6",
        "owner_name": "Vizartos",
        "culture": "empire",
        "x_position": "566.2401",
        "y_position": "347.43",
        "prosperity": "2600",
        "wall_level": "3",
        "desc_text": "Phycaon sits at the head of the Sethys valley, one of the main grain-producing regions of the central Empire. Once the largest of the Palaic cities, its leaders led a league of the tribes against imperial encroachment into the region. But when the empire's victory looked inevitable, they made their peace. The population, now thoroughly Calradicized, have a reputation for being serious, respectable and trade-minded, dependable if a bit humorless.",
        "bound_villages": [
            "village_ES6_1",
            "village_ES6_2"
        ]
    },
    {
        "id": "town_ES7",
        "name": "Syronea",
        "owner_id": "clan_empire_south_5",
        "owner_name": "Julios",
        "culture": "empire",
        "x_position": "651.026",
        "y_position": "387.791",
        "prosperity": "4000",
        "wall_level": "3",
        "desc_text": " Syronea sits on the eastern shores of Lake Tanaesis. This city, once peaceful and rich, was once a byword for luxury and decadence. This was the center of the Empire's silk industry and an entrepot for the goods flowing in from what was known as Transtanaesia, the imperial possessions and protectorates beyond the great lake. But the coming of the Khuzaits ripped the Transtanaesia from the Empire's grasp and the Senatorial families of Syronea were forced to relearn the arts of war, dusting off old gilded armors and sharpening bejewelled swords to lead their followers against Urkhun's warriors.",
        "bound_villages": [
            "village_ES7_1",
            "village_ES7_2"
        ]
    },
    {
        "id": "town_S1",
        "name": "Varcheg",
        "owner_id": "clan_sturgia_1",
        "owner_name": "Gundaroving",
        "culture": "sturgia",
        "x_position": "361.256",
        "y_position": "554.313",
        "prosperity": "3100",
        "wall_level": "3",
        "desc_text": null,
        "bound_villages": [
            "village_S1_1",
            "village_S1_3"
        ]
    },
    {
        "id": "town_S2",
        "name": "Balgard",
        "owner_id": "clan_sturgia_1",
        "owner_name": "Gundaroving",
        "culture": "sturgia",
        "x_position": "467.86",
        "y_position": "570.509",
        "prosperity": "2300",
        "wall_level": "3",
        "desc_text": "Balgard, which sits on the icy waters of Mazopor bay, was founded by migrants from the Nordlands. Legend holds that the initial wave of Nords arrogantly demanded tribute from the nearby Vakken and Sturgian tribes, who formed an alliance and drove the newcomers back to their ships. But the victors fell out over the spoils, until a canny Nord, Gundar, landed and volunteered to help them fairly divvy up the weapons and armor of his dead kinsmen. The residents recognized Gundar's lordship over the region and his descendants, intermarried with the Sturgians, are today the grand princes of Sturgia.",
        "bound_villages": [
            "village_S2_1",
            "village_S2_2"
        ]
    },
    {
        "id": "town_S3",
        "name": "Omor",
        "owner_id": "clan_sturgia_2",
        "owner_name": "Kuloving",
        "culture": "sturgia",
        "x_position": "451.107",
        "y_position": "515.464",
        "prosperity": "3200",
        "wall_level": "3",
        "desc_text": "Omor sits on the eastern shores of Lake Laconis. Long before the Sturgians formed themselves into a principality it was a holy site for the forest tribes, who worshipped their gods and ancestors in the sacred oak trees of the nearby woods. Today, it is an emporium for fur trappers and woodsmen who prowl the Ircara wildlands to the east, and the primeval peace of the forests is drowned out by the sounds of bartering, saws, and the unloading of ships at the lake.",
        "bound_villages": [
            "village_S3_1",
            "village_S3_2"
        ]
    },
    {
        "id": "town_S4",
        "name": "Varnovapol",
        "owner_id": "clan_sturgia_4",
        "owner_name": "Ormidoving",
        "culture": "sturgia",
        "x_position": "540.416",
        "y_position": "548.273",
        "prosperity": "3300",
        "wall_level": "2",
        "desc_text": "Varnovapol, which sits beneath the Chertyg mountains on the crystal waters of Lake Laconis, has the dubious honor of being perhaps the most-often conquered city in Calradia. Originally it was a colony of the Empire, infamous as a place of exile for dissident senators, before it was seized by Nords as a base to expand their influence into the Sturgian fur trade. It was taken by the Alkit tribe from the eastern steppe and briefly served as the capital of a small khanate, before finally falling to the fierce Ormidoving clan.",
        "bound_villages": [
            "village_S4_1",
            "village_S4_3",
            "village_S4_4"
        ]
    },
    {
        "id": "town_S5",
        "name": "Tyal",
        "owner_id": "clan_sturgia_3",
        "owner_name": "Vagiroving",
        "culture": "sturgia",
        "x_position": "647.079",
        "y_position": "569.108",
        "prosperity": "1700",
        "wall_level": "3",
        "desc_text": "Tyal sits in the western foothills of Mount Iltan, on the eastern borders of the Sturgian lands. This region has long stood aloof from the power struggles of the other Sturgian principalities. Its people are known as wanderers, traders, horse breeders and fur-trappers. The local aristocracy has occasionally exchanged princesses with the steppe tribes to the east to firm up a truce or a trade pact, and proudly includes the names of several great khans on their list of ancestors.",
        "bound_villages": [
            "village_S5_1",
            "village_S5_2"
        ]
    },
    {
        "id": "town_S6",
        "name": "Sibir",
        "owner_id": "clan_sturgia_6",
        "owner_name": "Isyaroving",
        "culture": "sturgia",
        "x_position": "549.771",
        "y_position": "586.259",
        "prosperity": "1900",
        "wall_level": "3",
        "desc_text": "Sibir was founded in a dark valley amid the Chertyg mountains by Nordic traders, who wished a base to buy furs from the local Vakken-speaking foresters. As the Sturgian tribes became principalities, and elected chieftains evolved into boyars who demanded taxes and labor as their due, this region became a magnet for Sturgians who had little taste for deference. Today, the ambitious Isyaroving family governs this region, but they must always balance their hunger for wealth and men to fight their wars with their subjects' reluctance to provide it.",
        "bound_villages": [
            "village_S6_1",
            "village_S6_2",
            "village_S6_3"
        ]
    },
    {
        "id": "town_S7",
        "name": "Revyl",
        "owner_id": "clan_sturgia_5",
        "owner_name": "Togaroving",
        "culture": "sturgia",
        "x_position": "296.82",
        "y_position": "580.832",
        "prosperity": "3100",
        "wall_level": "3",
        "desc_text": "Revyl, chief town of the rocky Kachyar peninsula, was a traditional rival of Balgard. According to legend the Balgardian princess Arkina, whose husband had been slain by the Revylians, accepted a proposal from her enemy's king to marry and settle the feud. On her wedding night, however, she barred the door of his hall and burned him and a hundred of his kinsmen and warriors alive inside. The feud has long since been settled by pacts and marriages with happier outcomes, although Revylians still resent the ascent of the Balgardian Gundaroving dynasty.",
        "bound_villages": [
            "village_S7_1",
            "village_S7_2"
        ]
    },
    {
        "id": "town_A1",
        "name": "Quyaz",
        "owner_id": "clan_aserai_1",
        "owner_name": "Banu Hulyan",
        "culture": "aserai",
        "x_position": "299.553",
        "y_position": "264.853",
        "prosperity": "4000",
        "wall_level": "1",
        "desc_text": "Quyaz was once a mercantile republic that dominated the trade between the western ocean and the Perassic Sea, speaking the now all-but-extinct Kannic tongue, a relative of Nahasawi. But imperial hegemony slowly snuffed out its trade, and the rulers was taken over by mercenaries from the Nahasa. It came intermittently under imperial subjugation but today is a prized holding of the Banu Hulyan, a leading clan of the Aserai sultanate.",
        "bound_villages": [
            "village_A1_1",
            "village_A1_2",
            "village_A1_4"
        ]
    },
    {
        "id": "town_A2",
        "name": "Husn Fulq",
        "owner_id": "clan_aserai_2",
        "owner_name": "Banu Sarran",
        "culture": "aserai",
        "x_position": "686.263",
        "y_position": "234.344",
        "prosperity": "4200",
        "wall_level": "1",
        "desc_text": "Husn Fulq sits at the southeastern edge of the Caldea, the network of rivers and brackish lagoons linking the Empire to the Aserai lands. Fulq, also known as Phalcos, was a dark-faced mercenary chieftain who came from lands far to the south. He founded a fortress here and then parlayed its strategic location into a fortune, taking bribes from the Empire and then from the Aserai to switch sides. After 20 years of playing both sides back and forth he sailed home in a ship laden with gold, but many clans of the Aserai proudly claim descent from him, and the 'Tricks of Fulq' are a staple of many a bazaar storyteller's repetoire.",
        "bound_villages": [
            "village_A2_2",
            "village_A2_3"
        ]
    },
    {
        "id": "town_A3",
        "name": "Iyakis",
        "owner_id": "clan_aserai_4",
        "owner_name": "Banu Qaraz",
        "culture": "aserai",
        "x_position": "493.537",
        "y_position": "111.743",
        "prosperity": "1800",
        "wall_level": "2",
        "desc_text": "Iyakis sits in a cleft in the Jarjara escarpment, where the waters of the fierce but brief desert rains can be trapped and used for irrigation. For generations ago it was an autonomous outpost of the Empire known as Yachios, dominated by the Carasios clan. Fifty years ago however they saw the writing on the wall for imperial dominion in the southlands, and began intermarrying themselves with the tribes of the Nahasa. Today, known as the Qaraz, they take their places in the councils of the sultanate like any other family of the Aserai.",
        "bound_villages": [
            "village_A3_1",
            "village_A3_3"
        ]
    },
    {
        "id": "town_A4",
        "name": "Razih",
        "owner_id": "clan_aserai_2",
        "owner_name": "Banu Sarran",
        "culture": "aserai",
        "x_position": "608.801",
        "y_position": "178.967",
        "prosperity": "4500",
        "wall_level": "1",
        "desc_text": "Razih is said to be the base from which Kannic explorers set forth to colonize the shores of the Perassic Sea in the centuries before the coming of the empire, the prows of their ships decorated with the intertwined vine leaves of the Kannic goddess of wealth, wine, love and war. Today, the Kannic tongue has been replaced by Nahasawi dialects and their religion is all but forgotten, but the symbol lives on, said to protect those who risk all for the sake of gain or glory.",
        "bound_villages": [
            "village_A4_1",
            "village_A4_2",
            "village_A4_4"
        ]
    },
    {
        "id": "town_A5",
        "name": "Hubyar",
        "owner_id": "clan_aserai_3",
        "owner_name": "Banu Qild",
        "culture": "aserai",
        "x_position": "561.609",
        "y_position": "119.752",
        "prosperity": "3200",
        "wall_level": "2",
        "desc_text": "The inland city of Hubyar is said to be built on the ruins of a luxurious hunting lodge built by the decadent and cruel king Thuran, whom the patriarch Asera slew in vengeance for the enslavement of his family. This memory may explain the worldview of the fierce and austere Banu Qild, who hold the castle today and who detest all frivolity. But the scent of jasmine that can be detected on the night breezes here carries an undercurrent of temptation. It was here that the hero Nimr came to grief, caught in the chamber of a Banu Qild maiden and left hanging in a cage in the market until he perished.",
        "bound_villages": [
            "village_A5_1",
            "village_A5_2",
            "village_A5_3"
        ]
    },
    {
        "id": "town_A6",
        "name": "Sanala",
        "owner_id": "clan_aserai_1",
        "owner_name": "Banu Hulyan",
        "culture": "aserai",
        "x_position": "399.712",
        "y_position": "208.931",
        "prosperity": "4300",
        "wall_level": "1",
        "desc_text": "The port of Sanala is the gateway through which the grain of the lower Damar has flowed forth to feed a hungry world. The Empire's periodic advances south of the Perassic Sea have usually been aimed at seizing this strategic prize. Although the legions were long ago forced to retreat, Sanala remains among the most cosmopolitan cities in Calradia, filled with merchants from many lands bidding for the lowest bulk prices.",
        "bound_villages": [
            "village_A6_1",
            "village_A6_2",
            "village_A6_3",
            "village_A6_4"
        ]
    },
    {
        "id": "town_A7",
        "name": "Askar",
        "owner_id": "clan_aserai_5",
        "owner_name": "Banu Arbas",
        "culture": "aserai",
        "x_position": "379.425",
        "y_position": "118.472",
        "prosperity": "2100",
        "wall_level": "1",
        "desc_text": "Askar dominates the middle stretches of the Damar River, as it weaves between the bluffs of the Jarjara Escarpment. This region has been thickly populated for thousands of years, but the river is restless, and every few centuries leaps its banks and erases what comes before. This latest regional capital was an imperial encampment  during their furthest penetration of the Nahasa several centuries ago, taken over by the Aserai tribes after the legions withdrew.",
        "bound_villages": [
            "village_A7_2",
            "village_A7_3",
            "village_A7_4"
        ]
    },
    {
        "id": "town_A8",
        "name": "Qasira",
        "owner_id": "clan_aserai_6",
        "owner_name": "Banu Atij",
        "culture": "aserai",
        "x_position": "490.694",
        "y_position": "163.097",
        "prosperity": "3500",
        "wall_level": "2",
        "desc_text": "The legendary Queen Eshora, it is said, punished the jinn who were harassing her people by imprisoning them in one of the caves above Qasira, carving the mystical eight-pointed star into the rock to seal them in. She sentenced them to haul water from the depths of the earth, feeding the springs that gush forth from the rocks and which for centuries have irrigated the date gardens of Qasira and its surrounding villages.",
        "bound_villages": [
            "village_A8_1",
            "village_A8_2"
        ]
    },
    {
        "id": "town_V1",
        "name": "Sargot",
        "owner_id": "clan_vlandia_1",
        "owner_name": "dey Meroc",
        "culture": "vlandia",
        "x_position": "210.378",
        "y_position": "383.893",
        "prosperity": "4500",
        "wall_level": "1",
        "desc_text": "Sargot is a common name for hills, promontories, islands and other defensible positions in western Calradia. It refers to a fortified encampment of the Massa, a tribe allied to the the Vlandians who joined their invasion.  Though the Massa moved on, their stay was often so traumatic for a district that the name remained long after their departure. This Sargot was actually founded on the ruins of an imperial town, resettled by Vlandians, and which has supplanted the memory of the community that came before it.",
        "bound_villages": [
            "village_V1_1",
            "village_V1_2"
        ]
    },
    {
        "id": "town_V2",
        "name": "Ocs Hall",
        "owner_id": "clan_vlandia_7",
        "owner_name": "dey Fortes",
        "culture": "vlandia",
        "x_position": "181.785",
        "y_position": "495.348",
        "prosperity": "4200",
        "wall_level": "2",
        "desc_text": "Ocs Hall is one of the few towns in the Vlandian kingdom that was founded after the seizure of the land from the Empire. This valley was once an isolated holdout of Battanians, centered on the Llyn Modris, a lake in a volcanic caldera that was said to be the  seat of a giant. This land was conquered by the Vlandian warlord Oca, who also gave his name to the nearby Ocspool lake. The Battanian tribes were driven inland, and took their legends with them.",
        "bound_villages": [
            "village_V2_1",
            "village_V2_2",
            "village_V2_3"
        ]
    },
    {
        "id": "town_V3",
        "name": "Pravend",
        "owner_id": "clan_vlandia_2",
        "owner_name": "dey Tihr",
        "culture": "vlandia",
        "x_position": "139.205",
        "y_position": "475.542",
        "prosperity": "3200",
        "wall_level": "2",
        "desc_text": "Paravenos was the second major colony founded by Calradios the Great, and it soon succeeded Charasea as the capital of the Calradians. Eventually, the empire's center of gravity moved east, but Paravenos retained its primacy as the economic center of the West. When Osric Iron-Arm the Vlandian invaded, he recognized Paravenos would be far more valuable as a seat of power than as simply as a source of loot,  and negotiated its surrender with local senators. It passed to a cadet branch of Osric's line, the dey Tihr clan, and is today known as Pravend.",
        "bound_villages": [
            "village_V3_2",
            "village_V3_3",
            "village_V3_4"
        ]
    },
    {
        "id": "town_V5",
        "name": "Galend",
        "owner_id": "clan_vlandia_1",
        "owner_name": "dey Meroc",
        "culture": "vlandia",
        "x_position": "107.5",
        "y_position": "411.689",
        "prosperity": "1900",
        "wall_level": "3",
        "desc_text": "Galend overlooks the wave-beaten Biscan coast. It takes in the catch from the Biscan's intrepid fishermen who venture out far into the western ocean, as well as the wool of sheep from the green fog-covered hills. The current line of Vlandian kings comes from the clans who settled in this region during Osric Iron-Arm's invasion.",
        "bound_villages": [
            "village_V5_1",
            "village_V5_2",
            "village_V5_3"
        ]
    },
    {
        "id": "town_V6",
        "name": "Jaculan",
        "owner_id": "clan_vlandia_3",
        "owner_name": "dey Arromanc",
        "culture": "vlandia",
        "x_position": "149.91",
        "y_position": "392.826",
        "prosperity": "4000",
        "wall_level": "1",
        "desc_text": "Jaculan sits in the warmer southern reaches of the Biscan coast, in rolling hills known for their olive trees. It was once a favored resort of the imperial aristocracy, who hunted wild boars amid the oak forests. The independent peasantry of this region are known for their heterodox ideas. The Brotherhood of the Woods is but the latest of a series of rebellions to have broken out here, sometimes aided by an aristocracy that considers them a tool to use against rival Vlandian houses.",
        "bound_villages": [
            "village_V6_1",
            "village_V6_2",
            "village_V6_3",
            "village_V6_4"
        ]
    },
    {
        "id": "town_V7",
        "name": "Charas",
        "owner_id": "clan_vlandia_4",
        "owner_name": "dey Cortain",
        "culture": "vlandia",
        "x_position": "174.271",
        "y_position": "336.303",
        "prosperity": "3000",
        "wall_level": "2",
        "desc_text": "The city known today as Charas is traditionally reckoned to be the first Calradian colony on the shores of their new continent. At the Empire's height, when the capital moved north to Paravenos,  Charasea remained a key hub of sea-faring and trade, while imperial aristocrats built their summer homes on the warm shores of the nearby gulf and cruised their pleasure-boats around its islands. When the Vlandians came, Charas fell into the hands of the ruthless House of dey Cortain, and its wealth funds their ambitions.",
        "bound_villages": [
            "village_V7_1",
            "village_V7_2"
        ]
    },
    {
        "id": "town_V8",
        "name": "Ostican",
        "owner_id": "clan_vlandia_8",
        "owner_name": "dey Molarn",
        "culture": "vlandia",
        "x_position": "135.09",
        "y_position": "547.52",
        "prosperity": "3900",
        "wall_level": "3",
        "desc_text": "Ostican was a minor imperial port that became a haven for seafarers of the northern oceans. Many were talented corsairs, employed by imperial factions to harry their foes during the latter empire's intermittent civil wars. Indeed, the some of the first Vlandians to come to Calradia's shores settled in the back alleys of this town, and no doubt sent word to their kinsmen of the riches to be had here should anyone invade in earnest.",
        "bound_villages": [
            "village_V8_1",
            "village_V8_2",
            "village_V8_3"
        ]
    },
    {
        "id": "town_V9",
        "name": "Rovalt",
        "owner_id": "clan_vlandia_6",
        "owner_name": "dey Valant",
        "culture": "vlandia",
        "x_position": "179.501",
        "y_position": "548.785",
        "prosperity": "2800",
        "wall_level": "2",
        "desc_text": "Rovalatys, in the mountains of the Ebor peninsula, was never fully an imperial town. Nordic migrants, drawn to the region by rumors of riches to be made prospecting for silver or hunting for furs, long outnumbered Calradians even before the Vlandian invasion. The Vlandians too recognized its potential, and despite its harsh winters this land is among the more populous regions of the kingdom, with bountiful fields in the valleys of the mountains feeding the constant flow of settlers from the south drawn here by their hunger for wealth.",
        "bound_villages": [
            "village_V9_1",
            "village_V9_2"
        ]
    },
    {
        "id": "town_B1",
        "name": "Marunath",
        "owner_id": "clan_battania_1",
        "owner_name": "fen Gruffendoc",
        "culture": "battania",
        "x_position": "291.2",
        "y_position": "442.757",
        "prosperity": "5000",
        "wall_level": "1",
        "desc_text": "Marunath, the 'Horse of the Ford,' is nowhere near a river. But Battanian bards love nothing more than an incongruous place-name around which a legend can be woven. In this case the hero Ochlaigan, who was foretold to defeat the seven sons of Glanys in seven duels near seven fords, encountered the last of his enemies here. He slit his horse's throat and crossed over the stream of blood that gushed forth, defeating his last enemy and fulfiling the prophecy.",
        "bound_villages": [
            "village_B1_1",
            "village_B1_2",
            "village_B1_3",
            "village_B1_4"
        ]
    },
    {
        "id": "town_B2",
        "name": "Dunglanys",
        "owner_id": "clan_battania_2",
        "owner_name": "fen Derngil",
        "culture": "battania",
        "x_position": "266.398",
        "y_position": "483.399",
        "prosperity": "4000",
        "wall_level": "3",
        "desc_text": "Dunglanys, the 'Rock of Glanys', stands on a high crag overlooking the Llyn Tywal, the pool of darkness at the heart of the Battanian lands. It was named after a ancient queen who, legend has it, married in succession five high kings of Battania, bestowing sovereignty upon them. It is the center of the rituals that underpin Battanian kingship, and though not every Battanian high king has ruled from here, all are eager to hold it.",
        "bound_villages": [
            "village_B2_1",
            "village_B2_2",
            "village_B2_3"
        ]
    },
    {
        "id": "town_B3",
        "name": "Car Banseth",
        "owner_id": "clan_battania_3",
        "owner_name": "fen Uvain",
        "culture": "battania",
        "x_position": "255.387",
        "y_position": "515.614",
        "prosperity": "2200",
        "wall_level": "2",
        "desc_text": "Car Banseth sits high on the cliffs of Ailta Druin. Staring north on a clear day, across lands that were once Battanian but are now held by the Sturgians and Vlandians, one can see the waters of the Bay of Varcheg. It is said that those who keep faith will one day witness from this high point the ships of the vanished High King Mon, who shall return to deliver his people from their enemies. But today, one is far more likely to see the sails of Nordic adventurers and mercenaries, coming to assist the foreigners in their relentless push into Battanian land.",
        "bound_villages": [
            "village_B3_1",
            "village_B3_2",
            "village_B3_3"
        ]
    },
    {
        "id": "town_B4",
        "name": "Seonon",
        "owner_id": "clan_battania_4",
        "owner_name": "fen Penraic",
        "culture": "battania",
        "x_position": "329.92",
        "y_position": "474.32",
        "prosperity": "2400",
        "wall_level": "2",
        "desc_text": "Seonon, sad Seonon, has a history as dark as the waters of the Llyn Tywal. Here Algana the Fair stood atop the tower lamenting the death of her beloved Gorawan, until the spirits of the Otherworld were themselves overcome with sadness and allowed his shade to ascend through the pool for a day and a night to console her. In latter days this land has often been ravaged by Sturgian raiders, and not far from here lies the wood where King Aeril disappeared, clearing the way for the rise of Caladog.",
        "bound_villages": [
            "village_B4_1",
            "village_B4_2",
            "village_B4_3",
            "village_B4_4"
        ]
    },
    {
        "id": "town_B5",
        "name": "Pen Cannoc",
        "owner_id": "clan_battania_5",
        "owner_name": "fen Giall",
        "culture": "battania",
        "x_position": "231.631",
        "y_position": "451.187",
        "prosperity": "3800",
        "wall_level": "3",
        "desc_text": "Pen Cannoc sits on a promontory overlooking the Trand river as it plunges from the Uchalion plateau into the Vlandian lowlands. Legends speak of the water-nymphs who live in the dark pools under the rock, luring travellers and invaders to their deaths, except on those rare occasions when they fall in love with a hero and grant him victory and blessings. Certainly the fisherfolk of this region have learned respect for the perils of the upper Trand, where a small misstep on slippery stone can cast one off a precipice into the waters below.",
        "bound_villages": [
            "village_B5_1",
            "village_B5_2",
            "village_B5_3"
        ]
    },
    {
        "id": "town_K1",
        "name": "Baltakhand",
        "owner_id": "clan_khuzait_2",
        "owner_name": "Khergit",
        "culture": "khuzait",
        "x_position": "732.504",
        "y_position": "536.542",
        "prosperity": "1800",
        "wall_level": "1",
        "desc_text": "Baltakhand, the Fortress of the Axe, was settled by the Iltanlar, mountain-dwelling cousins of the Khuzaits. Centuries ago their beys descended into the plains and created the fortress here that guards the portages of Iltan, the network of lakes and rivers that divides the Sturgian lands from the Khuzaits' realm. Bitter winters protected them from the reach of the Empire, but no blast of wind was cutting enough to stop the horsemen of Khan Urkhun, who 40 years ago forced this town to submit to the khanate.",
        "bound_villages": [
            "village_K1_1",
            "village_K1_2",
            "village_K1_4"
        ]
    },
    {
        "id": "town_K2",
        "name": "Akkalat",
        "owner_id": "clan_khuzait_4",
        "owner_name": "Tigrit",
        "culture": "khuzait",
        "x_position": "726.701",
        "y_position": "372.704",
        "prosperity": "1700",
        "wall_level": "2",
        "desc_text": "The town that the Khuzaits know as Akkalat, the White Fortress, was built by the fearsome Padishah Hoshtar on one of his periodic attempts to conquer the Devseg. For decades the sacred flame that burned from the top of the citadel symbolized his suzerainty over the tribes here. But the Padishah's realm like the Empire is on the defensive and has retreated to the east. Today the Khan's horsetail banners fly in its place.",
        "bound_villages": [
            "village_K2_1",
            "village_K2_2"
        ]
    },
    {
        "id": "town_K3",
        "name": "Makeb",
        "owner_id": "clan_khuzait_1",
        "owner_name": "Urkhunait",
        "culture": "khuzait",
        "x_position": "685.692",
        "y_position": "480.056",
        "prosperity": "3700",
        "wall_level": "3",
        "desc_text": "Makeb sits on the northern tip of Lake Tanaesis, Tanaz in the steppe tongue. Here, it guards the cataract over which the Karakaz river empties into the lake. This city has long been ruled by petty khans and shahs, who collect tolls from traders forced to haul their boats around the rapids. The last of those rulers was beheaded by Urkhun himself after he refused a demand of tribute, after which the ruling family of the Khuzaits seized this town for themselves.",
        "bound_villages": [
            "village_K3_1",
            "village_K3_2",
            "village_K3_3"
        ]
    },
    {
        "id": "town_K4",
        "name": "Ortongard",
        "owner_id": "clan_khuzait_3",
        "owner_name": "Arkit",
        "culture": "khuzait",
        "x_position": "745.826",
        "y_position": "448.187",
        "prosperity": "3200",
        "wall_level": "2",
        "desc_text": "Ortongard sits in the dry center of the Devseg plateau, which is dry for most of the year but offers rich grazing in the spring. Founded by Darshi-speaking merchants, it made its wealth buying horses, sheep and cattle from the surrounding herding villages and sending them west to the markets of the empire in huge drives, accompanied by guards to ward off raiders from the steppes. Neither its walls nor its mercenary armies could withstand the coming of Khan Urkhun, however, who it granted to the Khergit clan in recognition of their valor.",
        "bound_villages": [
            "village_K4_2",
            "village_K4_3",
            "village_K4_4"
        ]
    },
    {
        "id": "town_K5",
        "name": "Chaikand",
        "owner_id": "clan_khuzait_1",
        "owner_name": "Urkhunait",
        "culture": "khuzait",
        "x_position": "684.811",
        "y_position": "421.592",
        "prosperity": "3900",
        "wall_level": "2",
        "desc_text": "Chaikand sits by the reed-marshes on the edge of Lake Tanaesis. In the years when the east was an imperial protectorate, boats laden with hides, wool and salt shuttled across the lake's placid waters, returning with imperial silks and silver. With the coming of the Khuzaits and the subsequent wars the water-trade stopped, but Chaikand remains a major trade entrepot and military base, the fief of the ruling Urkhunait clan. From the pavilions of his palace, the khan can look out across the lake and see the hazy outline of hills that he may one day graze his horses upon.",
        "bound_villages": [
            "village_K5_2",
            "village_K5_3",
            "village_K5_4"
        ]
    },
    {
        "id": "town_K6",
        "name": "Odokh",
        "owner_id": "clan_khuzait_5",
        "owner_name": "Harfit",
        "culture": "khuzait",
        "x_position": "752.864",
        "y_position": "336.823",
        "prosperity": "1700",
        "wall_level": "3",
        "desc_text": "The town of Odokh sits at the foot of Kohi Rohini, the mountains of the dawn. Among the most remote of the towns of the Devseg, it is reputed to have been the abode of King Ahhak, a mythical tyrant from whose shoulders flowed serpents. Even today the Kohi Rohini has a reputation for black magic and mystery that helps keep outsiders at bay. The city fell during the Khuzait conquest to the Harfit clan, who have intermarried with the mountain peoples, and who honor their customs, participate in their rituals, and keep their secrets.",
        "bound_villages": [
            "village_K6_1",
            "village_K6_2",
            "village_K6_3"
        ]
    }
]